# customer-processor - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda_identity_v1_event_retry[0].data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_lambda_identity_v1_event.data.archive_file.default: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/customer_processor_identity_v1_event_retry_0]
module.common_resources.module.aws_lambda_identity_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.module.aws_lambda_identity_v1_event.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/customer_processor_identity_v1_event]
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_identity_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_identity_v1_event.aws_iam_role.lambda_role: Refreshing state... [id=le-customer_processor_identity_v1_event]
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].aws_iam_role.lambda_role: Refreshing state... [id=le-customer_processor_identity_v1_event_retry_0]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 1s [id=cockroachdb_serverless_cluster_id]
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Read complete after 1s [id=upstash_kafka_credential_secret_name]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 1s [id=upstash_kafka_cluster_credential_id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=89aed7d6-74bd-48f1-b647-6af2544ab965:customer_processor]
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Reading...
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 1s [id=upstash_kafka_cluster_id]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.module.aws_lambda_identity_v1_event.aws_iam_role_policy_attachment.default: Refreshing state... [id=le-customer_processor_identity_v1_event-20230526003245118800000001]
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].aws_iam_role_policy_attachment.default: Refreshing state... [id=le-customer_processor_identity_v1_event_retry_0-20230526003245121900000002]
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:754682412926:secret:upstash_kafka_credential_854966-eP4Z8T]
module.common_resources.module.aws_lambda_identity_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_identity_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=850680952]
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=850680952]
module.common_resources.module.aws_lambda_identity_v1_event.aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-customer_processor_identity_v1_event:lambda-secrets-policy-customer_processor_identity_v1_event]
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-customer_processor_identity_v1_event_retry_0:lambda-secrets-policy-customer_processor_identity_v1_event_retry_0]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 0s [id=upstash-cluster-09f3f36d-4eb7-4cbd-92a0-6cf27d288db1]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 0s [id=upstash-kafka-credential-eb242819-37a2-4bda-95c8-95845e1d3f58]
module.common_resources.module.aws_lambda_identity_v1_event.data.archive_file.default: Read complete after 1s [id=4dae073eb815c7c4a60e16dcee6e3caa5b927871]
module.common_resources.module.aws_lambda_identity_v1_event.aws_lambda_function.default: Refreshing state... [id=customer_processor_identity_v1_event]
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].data.archive_file.default: Read complete after 1s [id=4dae073eb815c7c4a60e16dcee6e3caa5b927871]
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].aws_lambda_function.default: Refreshing state... [id=customer_processor_identity_v1_event_retry_0]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_identity_v1_event_retry_topics[0]: Refreshing state... [id=4b44154b-0188-4dc8-a062-d22f50bd6fc1]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_identity_v1_event_topic: Refreshing state... [id=bb13d463-969f-4623-9329-6900393e2488]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda_identity_v1_event.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "customer_processor_identity_v1_event"
      ~ last_modified                  = "2023-05-26T05:52:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "dCvfhWgWtohCqagmlGslk9EtNoggNBCJD7cZL1qxofk=" -> "khRAQO+pjJ/2symFHCwg3h937lGQQGxWDXtMKIlFs+0="
        tags                           = {
            "domain"        = "customer"
            "environment"   = "staging"
            "resource"      = "customer-processor"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "striking-caiman-7501-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "4266c8cb2fed44d0ad797201a2e02a68"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "c3RyaWtpbmctY2FpbWFuLTc1MDEkoN_jLmJ-2v_pseQpmftvn5l-RyAzXMPw9Vk"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.aws_lambda_identity_v1_event_retry[0].aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "customer_processor_identity_v1_event_retry_0"
      ~ last_modified                  = "2023-05-26T05:52:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "dCvfhWgWtohCqagmlGslk9EtNoggNBCJD7cZL1qxofk=" -> "khRAQO+pjJ/2symFHCwg3h937lGQQGxWDXtMKIlFs+0="
        tags                           = {
            "domain"        = "customer"
            "environment"   = "staging"
            "resource"      = "customer-processor"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "striking-caiman-7501-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "4266c8cb2fed44d0ad797201a2e02a68"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "c3RyaWtpbmctY2FpbWFuLTc1MDEkoN_jLmJ-2v_pseQpmftvn5l-RyAzXMPw9Vk"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "customer_processor"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "89aed7d6-74bd-48f1-b647-6af2544ab965:customer_processor"
        name       = "customer_processor"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "426148a3-c8a5-4d9c-ab92-a8b116d0a19e" -> "5501b03b-3d48-421f-a60d-fb6ab7312230"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*